app/Controllers/Auth.php

SELECT *
FROM `users`
---
    public function index()
    {
        $data['users'] = $this->AuthModel->findAll();