app/Controllers/GolonganController.php

    public function golongan()
    {
        $data['title'] = 'Data Golongan';
        $data['golongan'] = $this->golonganModel->findAll(); // Ambil semua data
---
SELECT *
FROM `golongan`