app/Controllers/Karyawan.php

SELECT *
FROM `golongan`
SELECT *
FROM `jabatan`
---
    public function index()
    {
        $data['title'] = 'Data Pegawai';
        $data['users'] = $this->karyawanModel->getAllData();
        $data['golongan_options'] = $this->golonganModel->findAll();
        $data['jabatan_options'] = $this->jabatanModel->findAll();