app/Models/AcaraModel.php

SELECT *
FROM `acara`
ORDER BY `id` DESC
---
    public function getAllAcara()
    {
        return $this->orderBy('id', 'DESC')->findAll();

DELETE FROM `acara`
WHERE `id` IN ('21')
---
    public function deleteAcara($id)
    {
        return $this->delete($id);