app/Models/KaryawanModel.php

SELECT *
FROM `data_karyawan`
---
    public function getAllData()
    {
        return $this->findAll();