app/Models/UpacaraModel.php

SELECT *
FROM `upacara`
ORDER BY `id` DESC
---
    public function getAllUpacara()
    {
        return $this->orderBy('id', 'DESC')->findAll();